
title: Suspicious Activity - injection_mock_pe.exe
id: 66249577fc2e2b04ebdb62a09f941138
status: experimental
description: Auto-generated by SymbolicHunter - Detects suspicious process activity
author: SymbolicHunter
date: 2025/10/07
references:
    - https://github.com/yourusername/SymbolicHunter
tags:
    - attack.execution
    - attack.defense_evasion
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith:
            - 'injection_mock_pe.exe'
        CommandLine|contains:
            - '__FindPESectionExec'
    condition: selection
falsepositives:
    - Legitimate administrative activity
level: high
