title: SymbolicHunter - Execution of injection_mock_pe.exe
id: 0b44db87-6424-4d8c-b283-ff26ebe42e36
status: experimental
description: Detects execution of a known suspicious binary identified by SymbolicHunter analysis
author: SymbolicHunter
date: 2025-10-15
references: []
logsource:
  category: process_creation
  product: windows
detection:
  selection_hash1:
    Hashes|contains: "4a17e675a6d0eeacff3f501fee8b52f9826c0b7476b91d6c9b8fa5d0024329d7"
  selection_hash2:
    sha256: "4a17e675a6d0eeacff3f501fee8b52f9826c0b7476b91d6c9b8fa5d0024329d7"
  selection_name:
    Image|endswith: "\injection_mock_pe.exe"
  condition: 1 of selection_*
falsepositives:
  - Unlikely
level: high
